package util_p;

import java.util.regex.Pattern;

public class RegexMain2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		 String [] mmArr = {"¿Âµø∞«","¿Âº≠∞«","¿Â«ı","¿Â≥≤∞«","¿Â","¿Â±∫","√÷¿Â±∫","¿Â¿Â¿Â",
	                "«ˆ∫Û","ø¯∫Û","πÃΩ∫≈Õ∫Û","ƒø««∫Û","ƒø««","ø¯µŒƒø««","¿Â»Ò∫Û","§°§§§ß","§°§©§§",
	                "¥Ÿ","∞¯ºÆ»£","±Ë»Òæ÷","≥™∫Òæﬂ","≥ ∫Òæ∆¥œ","123-456","1234-5678",
	                "1234-5678-9012","123-5678-9012","12-5678-9012","12-568-9012",
	                "123-678-9012","123-567833-9012","12-58-9012","1a",
	                "abc","abc_def","1234","ab_1234","ab1234","aaa@aaa.aaa","aaa@aaaaaa","aaaaaa.aaa@",
	                "ab56","AABB","aBCd","1","123","12","3","1234abc@aaa.aaa","1a2b","a12",
	                "^","^^","12^34abc@aaa.aaa","1a2b^","^a12","123456.^",
	                "\\^","^\\^",".^","\\^^"};
		 
		 
		 ///§ª§Ω
		 String [] ppArr={"¿Â","¿Â.","¿Â.*","¿Â*",".*¿Â",".*¿Â.*","[¿Â|«ˆ].*",".*∫Û",
				 "[0-9]","[0-9]*","[0-9].",".*[0-9].*",".*[a-zA-Z].*","[0-9a-zA-Z]*","[0-9a-zA-Z@_.]*",
				 "[§°-§æ]*","[∞°-∆R]*",".*[ƒ´-µi][∆ƒ-¿ò].*",
				 ".{3}","[0-9]{3}","[0-9a-zA-Z]{3}","[0-9a-zA-Z@_.]{3,6}",
				 "[0-9a-zA-Z@_.]{3,}","[0-9]{2,3}-[0-9]{3,4}-[0-9]{4}",
				 "[0-9a-zA-Z]{3,}@[0-9a-zA-Z_.]{5,}", "[0-9a-zA-Z]{3,}@[0-9a-zA-Z_]{2,}[.][0-9a-zA-Z]{3,}",
				 //"[0-9a-zA-Z@_.]{,6}",
				 "[0-9^]*","[^0-9]*",
		 };
		 
		 for (String pp : ppArr) {
			String str =pp+":";
			for (String mm : mmArr) {
				if(Pattern.matches(pp, mm))
				str+=mm+",";
			}
			System.out.println(str);
		}
	}

}
